0xsmirk/mcu_cmsis_svd/SiliconLabs/SiM3_NRND/SIM3L1x6.svd
<?xml version="1.0" encoding="utf-8"?>
<device schemaVersion="1.0" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="CMSIS-SVD_Schema_1_0.xsd" >
<name>SIM3L166_C</name>
	<version>1</version>
	<description>256K Flash, 32K RAM, LCD, 64 PIN</description>
	<addressUnitBits>8</addressUnitBits>
	<width>32</width>
	<size>32</size>
	<access>read-write</access>
	<peripherals>
		<peripheral>
			<name>ACCTR_0</name>
			<version>A</version>
			<description>None</description>
			<groupName>ACCTR_0</groupName>
			<baseAddress>0x40042000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0xffc</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>ACCTR0_IRQn</name>
				<value>22</value>
			</interrupt>
			<registers>
				<!--BASEPOINTER_START_1-->
				<register>
					<name>CONFIG</name>
					<description>Configuration</description>
					<addressOffset>0x0</addressOffset>
					<resetValue>0x02000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>UPDSTSF</name>
							<description>Write Update Status Flag. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>An internal pulse counter register update is not in progress.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>An internal pulse counter register update is in progress.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DBGSEL</name>
							<description>Debug Signal Select. </description>
							<bitOffset>5</bitOffset>
							<bitWidth>3</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>NONE</name>
									<description>No debug signals output.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LCC0_LCC1</name>
									<description>(LC Mode) DBG0 = CMP0OUT,  DBG1 = CMP1OUT.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LCC0_INT0</name>
									<description>(LC Mode) DBG0 = CMP0OUT,  DBG1 = INTEG0.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LCC1_INT1</name>
									<description>(LC Mode) DBG0 = CMP1OUT,  DBG1 = INTEG1.</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INT0_INT1</name>
									<description>(Any Mode) DBG0 = INTEG0  DBG1 = INTEG1.</description>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CMP0_CMP1</name>
									<description>(Switch Mode) DBG0 = CMP0OUT,  DBG1 = CMP1OUT.</description>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CMP0_INT0</name>
									<description>(Switch Mode) DBG0 = CMP0OUT,  DBG1 = INTEG0.</description>
									<value>6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CMP1_INT1</name>
									<description>(Switch Mode) DBG0= CMP1OUT,  DBG1 = INTEG1.</description>
									<value>7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FLQDEN</name>
							<description>Flutter Quadrature-to-Dual Switch Enable. </description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>The pulse counter remains in quadrature mode during a flutter event.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>The pulse counter switches from quadrature mode to dual mode during a flutter event.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FLSTPEN</name>
							<description>Flutter Stop Enable. </description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>The pulse counter continues operating during a flutter event.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>The 24-bit counters stop counting during a flutter event.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TOPMD</name>
							<description>Topology Mode. </description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>SWITCH</name>
									<description>Select the switch closure topology.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LC</name>
									<description>Select the LC resonant topology.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PCMD</name>
							<description>Pulse Counter Mode. </description>
							<bitOffset>30</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the pulse counter.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SINGLE</name>
									<description>Select single channel mode.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DUAL</name>
									<description>Select dual channel mode.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>QUADRATURE</name>
									<description>Select quadrature mode.</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>CONTROL</name>
					<description>Control Register</description>
					<addressOffset>0x10</addressOffset>
					<resetValue>0x44000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CMPLTH</name>
							<description>Comparator Low Threshold. </description>
							<bitOffset>15</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>32_PERCENT</name>
									<description>Set the digital comparator low threshold to 32% of VIO.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>36_PERCENT</name>
									<description>Set the digital comparator low threshold to 36% of VIO.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>40_PERCENT</name>
									<description>Set the digital comparator low threshold to 40% of VIO.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>44_PERCENT</name>
									<description>Set the digital comparator low threshold to 44% of VIO.</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CMPHTH</name>
							<description>Comparator High Threshold. </description>
							<bitOffset>17</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>48_PERCENT</name>
									<description>Set the digital comparator high threshold to 48% of VIO.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>52_PERCENT</name>
									<description>Set the digital comparator high threshold to 52% of VIO.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>56_PERCENT</name>
									<description>Set the digital comparator high threshold to 56% of VIO.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>60_PERCENT</name>
									<description>Set the digital comparator high threshold to 60% of VIO.</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CALMD</name>
							<description>Automatic Calibration Mode. </description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>UNTIL_PASS</name>
									<description>Continue to calibrate until a passing condition occurs.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>UNTIL_FAIL</name>
									<description>Continue to calibrate until a failing condition occurs.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CALPUMD</name>
							<description>Automatic Calibration Pull-up Mode. </description>
							<bitOffset>20</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>FULL</name>
									<description>Use full pull-up mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SMALL</name>
									<description>Use small pull-up mode.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MEDIUM</name>
									<description>Use medium pull-up mode.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LARGE</name>
									<description>Use large pull-up mode.</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FPUPEN</name>
							<description>Force Continuous Pull-up Enable. </description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Pull-ups are enabled automatically by hardware.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Always enable the pull-ups.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FPDNEN</name>
							<description>Force Ground Input Enable. </description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable input grounding.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable input grounding. The IN0 and IN1 inputs are grounded.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PUVAL</name>
							<description>Pull-up Value. </description>
							<bitOffset>24</bitOffset>
							<bitWidth>5</bitWidth>
						</field>
						<field>
							<name>CALSEL</name>
							<description>Automatic Calibration Input Select. </description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>IN0</name>
									<description>Calibrate the IN0 input.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>IN1</name>
									<description>Calibrate the IN1 input.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CALRF</name>
							<description>Calibration Result Flag. </description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>The automatic calibration operation did not succeed.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>The automatic calibration operation succeeded.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CALBUSYF</name>
							<description>Calibration Busy Flag. </description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>A calibration operation is not in progress.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>A calibration operation is in progress. Hardware will clear this flag when the operation completes.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>LCCONFIG</name>
					<description>LC Configuration</description>
					<addressOffset>0x20</addressOffset>
					<resetValue>0x01718C61</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>PEMD</name>
							<description>LC Pulse Extension Mode. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>LOW</name>
									<description>Stretch the LC comparator output low pulses by approximately 20 ns.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGH</name>
									<description>Stretch the LC comparator output high pulses by approximately 20 ns.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>NONE</name>
									<description>No pulse extension.</description>
									<value>2</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CMP0FTH</name>
							<description>LC Comparator 0 Fine Threshold. </description>
							<bitOffset>2</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>CMP0CTH</name>
							<description>LC Comparator 0 Coarse Threshold. </description>
							<bitOffset>5</bitOffset>
							<bitWidth>6</bitWidth>
						</field>
						<field>
							<name>CMP0THR</name>
							<description>LC Comparator 0 Threshold Range. </description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>LOW</name>
									<description>Set the comparator 0 threshold to the low range (0 V to VIO/8 in 48 steps).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FULL</name>
									<description>Set the comparator 0 threshold to a full range (0 V to VIO in 64 steps).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CMP1FTH</name>
							<description>LC Comparator 1 Fine Threshold. </description>
							<bitOffset>12</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>CMP1CTH</name>
							<description>LC Comparator 1 Coarse Threshold. </description>
							<bitOffset>15</bitOffset>
							<bitWidth>6</bitWidth>
						</field>
						<field>
							<name>CMP1THR</name>
							<description>LC Comparator 1 Threshold Range. </description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>LOW</name>
									<description>Set the comparator 1 threshold to the low range (0 V to VIO/8 in 48 steps).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FULL</name>
									<description>Set the comparator 1 threshold to a full range (0 V to VIO in 64 steps).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CMPLHYS</name>
							<description>LC Comparator Low-side Hysteresis. </description>
							<bitOffset>22</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>0_MV</name>
									<description>Set both LC comparators to use 0 mV low-side hysteresis.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>5_MV</name>
									<description>Set both LC comparators to use 5 mV low-side hysteresis.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>10_MV</name>
									<description>Set both LC comparators to use 10 mV low-side hysteresis.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>20_MV</name>
									<description>Set both LC comparators to use 20 mV low-side hysteresis.</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CMPHHYS</name>
							<description>LC Comparator High-side Hysteresis. </description>
							<bitOffset>24</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>0_MV</name>
									<description>Set both LC comparators to use 0 mV high-side hysteresis.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>5_MV</name>
									<description>Set both LC comparators to use 5 mV high-side hysteresis.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>10_MV</name>
									<description>Set both LC comparators to use 10 mV high-side hysteresis.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>20_MV</name>
									<description>Set both LC comparators to use 20 mV high-side hysteresis.</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CMPMD</name>
							<description>LC Comparator Mode. </description>
							<bitOffset>26</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>5_US</name>
									<description>Mode 0 (slowest response time, lowest power consumption).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1_US</name>
									<description>Mode 1.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>400_NS</name>
									<description>Mode 2.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>200_NS</name>
									<description>Mode 3 (fastest response time, highest power consumption).</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CMP0CNT1EN</name>
							<description>LC Comparator 0 to Count 1 Enable. </description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Use LC comparator 0 as an input to counter 0 and LC comparator 1 as an input to counter 1.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Use LC comparator 0 as an input to both counter 0 and counter 1.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FCMP0EN</name>
							<description>Force LC Comparator 0 On Enable. </description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Hardware automatically turns LC comparator 0 on and off.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Force LC comparator 0 always on.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FCMP1EN</name>
							<description>Force LC Comparator 1 On Enable. </description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Hardware automatically turns LC comparator 1 on and off.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Force LC comparator 1 always on.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
