0xsmirk/mcu_cmsis_svd/SiliconLabs/SiM3_NRND/SIM3L1x6.svd
				<register>
					<name>LCMODE</name>
					<description>LC Mode</description>
					<addressOffset>0x40</addressOffset>
					<resetValue>0x0258A742</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>ATRKEN</name>
							<description>Automatic Tracking Enable. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable automatic tracking.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable automatic tracking. A new MAX value of any size will increase both the MAX and MIN by 1, and a new MIN value of any size will decrease both the MAX and MIN by 1.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ACDEN</name>
							<description>Automatic Center Discriminator Enable. </description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable automatic center discriminator mode. Firmware must set the CD0 and CD1 fields. </description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable automatic center discriminator mode. Hardware will keep the CD0 and CD1 fields centered between MAX and MIN.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LCD0HYS</name>
							<description>LC Discriminator 0 Digital Hysterisis. </description>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>ZERO</name>
									<description>A high-to-low transition occurs if LCCOUNT0 is less than CD0.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MINUS1</name>
									<description>A high-to-low transition occurs if LCCOUNT0 is less than CD0 - 1.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MINUS2</name>
									<description>A high-to-low transition occurs if LCCOUNT0 is less than CD0 - 2.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MINUS3</name>
									<description>A high-to-low transition occurs if LCCOUNT0 is less than CD0 - 3.</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LCD1HYS</name>
							<description>LC Discriminator 1 Digital Hysterisis. </description>
							<bitOffset>4</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>ZERO</name>
									<description>A high-to-low transition occurs if LCCOUNT1 is less than CD1.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MINUS1</name>
									<description>A high-to-low transition occurs if LCCOUNT1 is less than CD1 - 1.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MINUS2</name>
									<description>A high-to-low transition occurs if LCCOUNT1 is less than CD1 - 2.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MINUS3</name>
									<description>A high-to-low transition occurs if LCCOUNT1 is less than CD1 - 3.</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>C0ZONE</name>
							<description>Counter 0 Active Zone Select. </description>
							<bitOffset>6</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>ZONEA</name>
									<description>Select zone A as the active zone for counter 0 (LCIN0 input).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ZONEB</name>
									<description>Select zone B as the active zone for counter 0 (LCIN0 input).</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ZONEC</name>
									<description>Select zone C as the active zone for counter 0 (LCIN0 input).</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ZONED</name>
									<description>Select zone D as the active zone for counter 0 (LCIN0 input).</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>C1ZONE</name>
							<description>Counter 1 Active Zone Select. </description>
							<bitOffset>8</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>ZONEA</name>
									<description>Select zone A as the active zone for counter 1 (LCIN1 input).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ZONEB</name>
									<description>Select zone B as the active zone for counter 1 (LCIN1 input).</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ZONEC</name>
									<description>Select zone C as the active zone for counter 1 (LCIN1 input).</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ZONED</name>
									<description>Select zone D as the active zone for counter 1 (LCIN1 input).</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P0ZONE</name>
							<description>Pulse 0 Active Zone Select. </description>
							<bitOffset>10</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the pulse 0 output (LCPUL0).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>C_ONLY</name>
									<description>Select zone C only as the active zone for the pulse 0 output (LCPUL0).</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>A_ONLY</name>
									<description>Select zone A only as the active zone for the pulse 0 output (LCPUL0).</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>A_AND_C</name>
									<description>Select zones A and C as the active zones for the pulse 0 output (LCPUL0).</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P1ZONE</name>
							<description>Pulse 1 Active Zone Select. </description>
							<bitOffset>12</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the pulse 1 output (LCPUL1).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>C_ONLY</name>
									<description>Select zone C only as the active zone for the pulse 1 output (LCPUL1).</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>A_ONLY</name>
									<description>Select zone A only as the active zone for the pulse 1 output (LCPUL1).</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>A_AND_C</name>
									<description>Select zones A and C as the active zones for the pulse 1 output (LCPUL1).</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PMD</name>
							<description>LC Pulse Mode. </description>
							<bitOffset>14</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable pulse mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TOGGLE</name>
									<description>Toggle at the start of zone A or zone C.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PULSE_LOW</name>
									<description>Set the pulse mode to idle high, pulse low.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PULSE_HIGH</name>
									<description>Set the pulse mode to idle low, pulse high.</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>B0ZONECEN</name>
							<description>Bias 0 Zone C Enable. </description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable bias 0 during zone C.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable bias 0 during zone C.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>B0ZONEBEN</name>
							<description>Bias 0 Zone B Enable. </description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable bias 0 during zone B.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable bias 0 during zone B.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>B0ZONEAEN</name>
							<description>Bias 0 Zone A Enable. </description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable bias 0 during zone A.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable bias 0 during zone A.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>B0ZONEPEN</name>
							<description>Bias 0 Zone P Enable. </description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable bias 0 during zone P.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable bias 0 during zone P.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>B0POL</name>
							<description>Bias 0 Polarity. </description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>PULSE_LOW</name>
									<description>Set bias 0 to idle high, pulse low.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PULSE_HIGH</name>
									<description>Set bias 0 to idle low, pulse high.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>B1ZONECEN</name>
							<description>Bias 1 Zone C Enable. </description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable bias 1 during zone C.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable bias 1 during zone C.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>B1ZONEBEN</name>
							<description>Bias 1 Zone B Enable. </description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable bias 1 during zone B.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable bias 1 during zone B.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>B1ZONEAEN</name>
							<description>Bias 1 Zone A Enable. </description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable bias 1 during zone A.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable bias 1 during zone A.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>B1ZONEPEN</name>
							<description>Bias 1 Zone P Enable. </description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable bias 1 during zone P.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable bias 1 during zone P.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>B1POL</name>
							<description>Bias 1 Polarity. </description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>PULSE_LOW</name>
									<description>Set bias 1 to idle high, pulse low.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PULSE_HIGH</name>
									<description>Set bias 1 to idle low, pulse high.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BMD</name>
							<description>Bias Mode. </description>
							<bitOffset>26</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>MODE0</name>
									<description>Disable the bias signals.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MODE1</name>
									<description>Use the bias signals externally only (LCBIAS0 and LCBIAS1 outputs).</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MODE2</name>
									<description>Use the bias signals internally only.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MODE3</name>
									<description>Use the bias signals externally (LCBIAS0 and LCBIAS1 outputs) and internally.</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LCMD</name>
							<description>LC Mode. </description>
							<bitOffset>28</bitOffset>
							<bitWidth>4</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>MODE0</name>
									<description>The LC pulse asserts throughout zone A or zone C with a single-ended comparator using the counter and discriminator.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MODE1</name>
									<description>The LC pulse asserts throughout zone A or zone C with differential comparators using the counter and discriminator.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MODE2</name>
									<description>The LC pulse asserts throughout zone A or zone C with a single-ended comparator sampling and holding at the end of the LC pulse.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MODE3</name>
									<description>The LC pulse asserts throughout zone A or zone C with differential comparators sampling and holding at the end of the LC pulse.</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MODE4</name>
									<description>The LC pulse starts at the beginning of zone A or C and stops with the timer with a single-ended comparator using the counter and discriminator.</description>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MODE5</name>
									<description>The LC pulse starts at the beginning of zone A or C and stops with the timer with differential comparators using the counter and discriminator.</description>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MODE6</name>
									<description>The LC pulse starts at the beginning of zone A or C and stops with the timer with a single-ended comparator sampling and holding at the end of the LC pulse.</description>
									<value>6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MODE7</name>
									<description>The LC pulse starts at the beginning of zone A or C and stops with the timer with differential comparators sampling and holding at the end of the LC pulse.</description>
									<value>7</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MODE8</name>
									<description>The LC pulse starts at beginning of zone A or C and stops with the rising edge of the external stop input (STOPx) with a single-ended comparator using the counter and discriminator.</description>
									<value>8</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MODE9</name>
									<description>The LC pulse starts at beginning of zone A or C and stops with the falling edge of the external stop input (STOPx) with single-ended comparators using the counter and discriminator.</description>
									<value>9</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MODE10</name>
									<description>The LC pulse starts at beginning of zone A or C and stops with the rising edge of the external stop input (STOPx) with a single-ended comparator sampling and holding at the end of the LC pulse.</description>
									<value>10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MODE11</name>
									<description>The LC pulse starts at beginning of zone A or C and stops with the falling edge of the external stop input (STOPx) with single-ended comparators sampling and holding at the end of the LC pulse.</description>
									<value>11</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MODE12</name>
									<description>Do not generate a pulse with a single-ended comparator using the timer and discrimintor.</description>
									<value>12</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MODE13</name>
									<description>Do not generate a pulse with differential comparators using the timer and discrimintor.</description>
									<value>13</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MODE14</name>
									<description>Do not generate a pulse with a single-ended comparator sampling and holding at the end of the zone.</description>
									<value>14</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MODE15</name>
									<description>Do not genreate a pulse with differential comparators sampling and holding at the end of the zone.</description>
									<value>15</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>LCCLKCONTROL</name>
					<description>LC Clock Control</description>
					<addressOffset>0x50</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CLKCYCLES</name>
							<description>LC Oscillator Clock Cycles. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>12</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CLKCAL</name>
							<description>LC Oscillator Calibration Start. </description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_IN_PROGRESS</name>
									<description>A calibration operation is not in progress.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>START</name>
									<description>Start an oscillator calibration or a calibration operation is in progress.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RELOAD</name>
							<description>LC Oscillator Reload Value. </description>
							<bitOffset>16</bitOffset>
							<bitWidth>12</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>LCLIMITS</name>
					<description>LC Counter Limits</description>
					<addressOffset>0x60</addressOffset>
					<resetValue>0x00FF00FF</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>MIN0</name>
							<description>LC Counter 0 Minimum Value. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>MAX0</name>
							<description>LC Counter 0 Maximum Value. </description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>MIN1</name>
							<description>LC Counter 1 Minimum Value. </description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>MAX1</name>
							<description>LC Counter 1 Maximum Value. </description>
							<bitOffset>24</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
