0xsmirk/mcu_cmsis_svd/SiliconLabs/SiM3_NRND/SIM3L1x6.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>CMP_0</name>
			<version>A</version>
			<description>None</description>
			<groupName>Comparator</groupName>
			<baseAddress>0x4001f000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0xffc</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>CMP0_IRQn</name>
				<value>30</value>
			</interrupt>
			<registers>
				<!--BASEPOINTER_START_1-->
				<register>
					<name>CONTROL</name>
					<description>Module Control</description>
					<addressOffset>0x0</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CMPFI</name>
							<description>Falling Edge Interrupt Flag. </description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>No comparator falling edge has occurred since this flag was last cleared.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>A comparator falling edge occurred since last flag was cleared.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CMPRI</name>
							<description>Rising Edge Interrupt Flag. </description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>No comparator rising edge has occurred since this flag was last cleared.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>A comparator rising edge occurred since last flag was cleared.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CMPOUT</name>
							<description>Output State. </description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>POS_LT_NEG</name>
									<description>Voltage on CMP+ &lt; CMP- (INVEN = 0).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>POS_GT_NEG</name>
									<description>Voltage on CMP+ &gt; CMP- (INVEN = 0).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CMPEN</name>
							<description>Comparator Enable. </description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the comparator.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the comparator.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>MODE</name>
					<description>Input and Module Mode</description>
					<addressOffset>0x10</addressOffset>
					<resetValue>0x00000800</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>NMUX</name>
							<description>Negative Input Select. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>CMPNN0</name>
									<description>Select CMPnN.0 (PB0.1).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CMPNN1</name>
									<description>Select CMPnN.1 (PB0.8).</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CMPNN2</name>
									<description>Select CMPnN.2 (PB1.1).</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CMPNN3</name>
									<description>Select CMPnN.3 (PB1.8).</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CMPNN4</name>
									<description>Select CMPnN.4 (RESERVED).</description>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CMPNN5</name>
									<description>Select CMPnN.5 (PB2.5).</description>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CMPNN6</name>
									<description>Select CMPnN.6 (PB3.3).</description>
									<value>6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CMPNN7</name>
									<description>Select CMPnN.7 (PB3.5).</description>
									<value>7</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CMPNN8</name>
									<description>Select CMPnN.8 (VREF Pin).</description>
									<value>8</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CMPNN9</name>
									<description>Select CMPnN.9 (VBAT).</description>
									<value>9</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CMPNN10</name>
									<description>Select CMPnN.10 (VDC).</description>
									<value>10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CMPNN11</name>
									<description>Select CMPnN.11 (Digital LDO Output).</description>
									<value>11</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CMPNN12</name>
									<description>Select CMPnN.12 (Memory LDO Output).</description>
									<value>12</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CMPNN13</name>
									<description>Select CMPnN.13 (Analog LDO Output).</description>
									<value>13</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CMPNN14</name>
									<description>Select CMPnN.14 (VIO).</description>
									<value>14</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CMPNN15</name>
									<description>Select CMPnN.15 (RESERVED).</description>
									<value>15</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PMUX</name>
							<description>Positive Input Select. </description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>CMPNP0</name>
									<description>Select CMPnP.0 (PB0.0).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CMPNP1</name>
									<description>Select CMPnP.1 (PB0.3).</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CMPNP2</name>
									<description>Select CMPnP.2 (PB1.0).</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CMPNP3</name>
									<description>Select CMPnP.3 (PB1.7).</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CMPNP4</name>
									<description>Select CMPnP.4 (PB2.0).</description>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CMPNP5</name>
									<description>Select CMPnP.5 (PB2.4).</description>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CMPNP6</name>
									<description>Select CMPnP.6 (PB3.2).</description>
									<value>6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CMPNP7</name>
									<description>Select CMPnP.7 (PB3.4).</description>
									<value>7</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CMPNP8</name>
									<description>Select CMPnP.8 (VREF Pin).</description>
									<value>8</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CMPNP9</name>
									<description>Select CMPnP.9 (RESERVED).</description>
									<value>9</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CMPNP10</name>
									<description>Select CMPnP.10 (Temperature Sensor Output).</description>
									<value>10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CMPNP11</name>
									<description>Select CMPnP.11 (Charge Pump / 2).</description>
									<value>11</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CMPNP12</name>
									<description>Select CMPnP.12 (Digital LDO Output).</description>
									<value>12</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CMPNP13</name>
									<description>Select CMPnP.13 (Memory LDO Output).</description>
									<value>13</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CMPNP14</name>
									<description>Select CMPnP.14 (Analog LDO Output).</description>
									<value>14</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CMPNP15</name>
									<description>Select CMPnP.15 (RESERVED).</description>
									<value>15</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>INMUX</name>
							<description>Input MUX Select. </description>
							<bitOffset>8</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIRECT</name>
									<description>Connects the NMUX signal to CMP- and the PMUX signal to CMP+.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CMPP_VSS</name>
									<description>Connects VSS to CMP- and the PMUX signal to CMP+.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CMPP_DAC</name>
									<description>Connects the NMUX signal to CMP-, the PMUX signal to the Comparator DAC voltage reference, and the DAC output to CMP+.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CMPN_DAC</name>
									<description>Connects the PMUX signal to CMP+, the NMUX signal to the Comparator DAC voltage reference, and the DAC output to CMP-.</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CMPMD</name>
							<description>Comparator Mode. </description>
							<bitOffset>10</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>MODE0</name>
									<description>Mode 0 (fastest response time, highest power consumption).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MODE1</name>
									<description>Mode 1.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MODE2</name>
									<description>Mode 2.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MODE3</name>
									<description>Mode 3 (slowest response time, lowest power consumption).</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FIEN</name>
							<description>Falling Edge Interrupt Enable. </description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the comparator falling edge interrupt.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the comparator falling edge interrupt.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RIEN</name>
							<description>Rising Edge Interrupt Enable. </description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the comparator rising edge interrupt.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the comparator rising edge interrupt.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DACLVL</name>
							<description>Comparator DAC Output Level. </description>
							<bitOffset>16</bitOffset>
							<bitWidth>6</bitWidth>
						</field>
						<field>
							<name>NWPUEN</name>
							<description>Negative Input Weak Pullup Enable. </description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the negative input weak pull up.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the negative input weak pull up.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PWPUEN</name>
							<description>Positive Input Weak Pullup Enable. </description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the positive input weak pull up.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the positive input weak pull up.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CMPHYN</name>
							<description>Negative Hysteresis Control. </description>
							<bitOffset>24</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable negative hysteresis.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>NEG_5_MV</name>
									<description>Set negative hysteresis to 5 mV.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>NEG_10_MV</name>
									<description>Set negative hysteresis to 10 mV.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>NEG_20_MV</name>
									<description>Set negative hysteresis to 20 mV.</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CMPHYP</name>
							<description>Positive Hysteresis Control. </description>
							<bitOffset>26</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable positive hysteresis.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>POS_5_MV</name>
									<description>Set positive hysteresis to 5 mV.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>POS_10_MV</name>
									<description>Set positive hysteresis to 10 mV.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>POS_20_MV</name>
									<description>Set positive hysteresis to 20 mV.</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>INVEN</name>
							<description>Invert Comparator Output Enable. </description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Do not invert the comparator output.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Invert the comparator output.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
