0xsmirk/mcu_cmsis_svd/SiliconLabs/SiM3_NRND/SIM3L1x6.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>DMAXBAR_0</name>
			<version>A</version>
			<description>None</description>
			<groupName>DMA</groupName>
			<baseAddress>0x40037000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0xffc</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>DMAERR_IRQn</name>
				<value>5</value>
			</interrupt>
			<interrupt>
				<name>DMACH0_IRQn</name>
				<value>6</value>
			</interrupt>
			<interrupt>
				<name>DMACH1_IRQn</name>
				<value>7</value>
			</interrupt>
			<interrupt>
				<name>DMACH2_IRQn</name>
				<value>8</value>
			</interrupt>
			<interrupt>
				<name>DMACH3_IRQn</name>
				<value>9</value>
			</interrupt>
			<interrupt>
				<name>DMACH4_IRQn</name>
				<value>10</value>
			</interrupt>
			<interrupt>
				<name>DMACH5_IRQn</name>
				<value>11</value>
			</interrupt>
			<interrupt>
				<name>DMACH6_IRQn</name>
				<value>12</value>
			</interrupt>
			<interrupt>
				<name>DMACH7_IRQn</name>
				<value>13</value>
			</interrupt>
			<interrupt>
				<name>DMACH8_IRQn</name>
				<value>14</value>
			</interrupt>
			<interrupt>
				<name>DMACH9_IRQn</name>
				<value>15</value>
			</interrupt>
			<registers>
				<!--BASEPOINTER_START_1-->
				<register>
					<name>DMAXBAR0</name>
					<description>Channel 0-7 Trigger Select</description>
					<addressOffset>0x0</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CH0SEL</name>
							<description>DMA Channel 0 Peripheral Select. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DTM0_A</name>
									<description>Service DTM0 A data requests.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SPI0_TX</name>
									<description>Service SPI0 TX data requests.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AES0_TX</name>
									<description>Service AES0 TX data requests.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>USART0_RX</name>
									<description>Service USART0 RX data requests.</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>I2C0_RX</name>
									<description>Service I2C0 RX data requests.</description>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>I2C0_TX</name>
									<description>Service I2C0 TX data requests.</description>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EPCA0_CAPTURE</name>
									<description>Service EPCA0 capture data requests.</description>
									<value>6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TIMER0L</name>
									<description>Service TIMER0L overflow data requests.</description>
									<value>7</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TIMER0H</name>
									<description>Service TIMER0H overflow data requests.</description>
									<value>8</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DMA0T0_RISE</name>
									<description>Service DMA0T0 rising edge data requests.</description>
									<value>9</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DMA0T0_FALL</name>
									<description>Service DMA0T0 falling edge data requests.</description>
									<value>10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>UNASSIGNED</name>
									<description>Unassigned.</description>
									<value>15</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH1SEL</name>
							<description>DMA Channel 1 Peripheral Select. </description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DTM0_B</name>
									<description>Service DTM0 B data requests.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SPI0_RX</name>
									<description>Service SPI0 RX data requests.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AES0_RX</name>
									<description>Service AES0 RX data requests.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>USART0_TX</name>
									<description>Service USART0 TX data requests.</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SARADC0</name>
									<description>Service SARADC0 data requests.</description>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EPCA0_CAPTURE</name>
									<description>Service EPCA0 capture data requests.</description>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EPCA0_CONTROL</name>
									<description>Service EPCA0 control data requests.</description>
									<value>6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TIMER1L</name>
									<description>Service TIMER1L overflow data requests.</description>
									<value>7</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TIMER1H</name>
									<description>Service TIMER1H overflow data requests.</description>
									<value>8</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DMA0T1_RISE</name>
									<description>Service DMA0T1 rising edge data requests.</description>
									<value>9</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DMA0T1_FALL</name>
									<description>Service DMA0T1 falling edge data requests.</description>
									<value>10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>UNASSIGNED</name>
									<description>Unassigned.</description>
									<value>15</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH2SEL</name>
							<description>DMA Channel 2 Peripheral Select. </description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DTM0_C</name>
									<description>Service DTM0 C data requests.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DTM2_A</name>
									<description>Service DTM2 A data requests.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENCDEC0_TX</name>
									<description>Service ENCDEC0 TX data requests.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AES0_XOR</name>
									<description>Service AES0 XOR data requests.</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SPI1_TX</name>
									<description>Service SPI1 TX data requests.</description>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>USART0_RX</name>
									<description>Service USART0 RX data requests.</description>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>I2C0_RX</name>
									<description>Service I2C0 RX data requests.</description>
									<value>6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>IDAC0</name>
									<description>Service IDAC0 data requests.</description>
									<value>7</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TIMER0L</name>
									<description>Service TIMER0L overflow data requests.</description>
									<value>8</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TIMER0H</name>
									<description>Service TIMER0H overflow data requests.</description>
									<value>9</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DMA0T0_RISE</name>
									<description>Service DMA0T0 rising edge data requests.</description>
									<value>10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DMA0T0_FALL</name>
									<description>Service DMA0T0 falling edge data requests.</description>
									<value>11</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>UNASSIGNED</name>
									<description>Unassigned.</description>
									<value>15</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH3SEL</name>
							<description>DMA Channel 3 Peripheral Select. </description>
							<bitOffset>12</bitOffset>
							<bitWidth>4</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DTM0_D</name>
									<description>Service DTM0 D data requests.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DTM2_B</name>
									<description>Service DTM2 B data requests.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENCDEC0_RX</name>
									<description>Service ENCDEC0 RX data requests.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SPI1_RX</name>
									<description>Service SPI1 RX data requests.</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>USART0_TX</name>
									<description>Service USART0 TX data requests.</description>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>I2C0_RX</name>
									<description>Service I2C0 RX data requests.</description>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>I2C0_TX</name>
									<description>Service I2C0 TX data requests.</description>
									<value>6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TIMER1L</name>
									<description>Service TIMER1L overflow data requests.</description>
									<value>7</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TIMER1H</name>
									<description>Service TIMER1H overflow data requests.</description>
									<value>8</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DMA0T1_RISE</name>
									<description>Service DMA0T1 rising edge data requests.</description>
									<value>9</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DMA0T1_FALL</name>
									<description>Service DMA0T1 falling edge data requests.</description>
									<value>10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>UNASSIGNED</name>
									<description>Unassigned.</description>
									<value>15</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH4SEL</name>
							<description>DMA Channel 4 Peripheral Select. </description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DTM1_A</name>
									<description>Service DTM1 A data requests.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DTM2_C</name>
									<description>Service DTM2 C data requests.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SPI0_TX</name>
									<description>Service SPI1 TX data requests.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AES0_TX</name>
									<description>Service AES0 TX data requests.</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SARADC0</name>
									<description>Service SARADC0 data requests.</description>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EPCA0_CAPTURE</name>
									<description>Service EPCA0 capture data requests.</description>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EPCA0_CONTROL</name>
									<description>Service EPCA0 control data requests.</description>
									<value>6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TIMER0L</name>
									<description>Service TIMER0L overflow data requests.</description>
									<value>7</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TIMER0H</name>
									<description>Service TIMER0H overflow data requests.</description>
									<value>8</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DMA0T0_RISE</name>
									<description>Service DMA0T0 rising edge data requests.</description>
									<value>9</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DMA0T0_FALL</name>
									<description>Service DMA0T0 falling edge data requests.</description>
									<value>10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>UNASSIGNED</name>
									<description>Unassigned.</description>
									<value>15</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH5SEL</name>
							<description>DMA Channel 5 Peripheral Select. </description>
							<bitOffset>20</bitOffset>
							<bitWidth>4</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DTM1_B</name>
									<description>Service DTM1 B data requests.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DTM2_D</name>
									<description>Service DTM2 D data requests.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SPI0_RX</name>
									<description>Service SPI0 RX data requests.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AES0_RX</name>
									<description>Service AES0 RX data requests.</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>USART0_RX</name>
									<description>Service USART0 RX data requests.</description>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>I2C0_RX</name>
									<description>Service I2C0 RX data requests.</description>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>IDAC0</name>
									<description>Service IDAC0 data requests.</description>
									<value>6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EPCA0_CONTROL</name>
									<description>Service EPCA0 control data requests.</description>
									<value>7</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TIMER1L</name>
									<description>Service TIMER1L overflow data requests.</description>
									<value>8</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TIMER1H</name>
									<description>Service TIMER1H overflow data requests.</description>
									<value>9</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DMA0T1_RISE</name>
									<description>Service DMA0T1 rising edge data requests.</description>
									<value>10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DMA0T1_FALL</name>
									<description>Service DMA0T1 falling edge data requests.</description>
									<value>11</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>UNASSIGNED</name>
									<description>Unassigned.</description>
									<value>15</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH6SEL</name>
							<description>DMA Channel 6 Peripheral Select. </description>
							<bitOffset>24</bitOffset>
							<bitWidth>4</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DTM1_C</name>
									<description>Service DTM1 C data requests.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DTM2_A</name>
									<description>Service DTM2 A data requests.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENCDEC0_TX</name>
									<description>Service ENCDEC0 TX data requests.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AES0_XOR</name>
									<description>Service AES0 XOR data requests.</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>USART0_TX</name>
									<description>Service USART0 TX data requests.</description>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>I2C0_RX</name>
									<description>Service I2C0 RX data requests.</description>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>I2C0_TX</name>
									<description>Service I2C0 TX data requests.</description>
									<value>6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SARADC0</name>
									<description>Service SARADC0 data requests.</description>
									<value>7</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TIMER0L</name>
									<description>Service TIMER0L overflow data requests.</description>
									<value>8</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TIMER0H</name>
									<description>Service TIMER0H overflow data requests.</description>
									<value>9</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DMA0T0_RISE</name>
									<description>Service DMA0T0 rising edge data requests.</description>
									<value>10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DMA0T0_FALL</name>
									<description>Service DMA0T0 falling edge data requests.</description>
									<value>11</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>UNASSIGNED</name>
									<description>Unassigned.</description>
									<value>15</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH7SEL</name>
							<description>DMA Channel 7 Peripheral Select. </description>
							<bitOffset>28</bitOffset>
							<bitWidth>4</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DTM1_D</name>
									<description>Service DTM1 D data requests.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DTM2_B</name>
									<description>Service DTM2 B data requests.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENCDEC0_RX</name>
									<description>Service ENCDEC0 RX data requests.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SPI1_TX</name>
									<description>Service SPI1 TX data requests.</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>USART0_RX</name>
									<description>Service USART0 RX data requests.</description>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>IDAC0</name>
									<description>Service IDAC0 data requests.</description>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TIMER1L</name>
									<description>Service TIMER1L overflow data requests.</description>
									<value>6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TIMER1H</name>
									<description>Service TIMER1H overflow data requests.</description>
									<value>7</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DMA0T1_RISE</name>
									<description>Service DMA0T1 rising edge data requests.</description>
									<value>8</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DMA0T1_FALL</name>
									<description>Service DMA0T1 falling edge data requests.</description>
									<value>9</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>UNASSIGNED</name>
									<description>Unassigned.</description>
									<value>15</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
