0xsmirk/mcu_cmsis_svd/SiliconLabs/SiM3_NRND/SIM3L1x6.svd
				<register>
					<name>VBMCONTROL</name>
					<description>VBAT Monitor Control</description>
					<addressOffset>0x70</addressOffset>
					<resetValue>0x22C00000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>VBMTH</name>
							<description>VBAT Monitor Threshold. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>5</bitWidth>
						</field>
						<field>
							<name>VBMBF</name>
							<description>VBAT Monitor Busy Flag. </description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>An update of the internal VBAT monitor registers is not in progress.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>The internal VBAT monitor registers are busy updating.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VBMCLKDIV</name>
							<description>VBAT Monitor Clock Divider. </description>
							<bitOffset>22</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>VBMCDEN</name>
							<description>VBAT Monitor Capacitor Divider Enable. </description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the VBAT monitor capacitor divider.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the VBAT monitor capacitor divider.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VBMOEN</name>
							<description>VBAT Monitor Offset Enable. </description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>The VBAT monitor threshold set by the VBMTH field functions as an absolute threshold value for the VBAT monitor.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>The VBAT monitor threshold set by the VBMTH field functions as an offset to the LCD contrast value set by CTRSTMD.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VBMEN</name>
							<description>VBAT Monitor Enable. </description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the VBAT monitor.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the VBAT monitor.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>SEGMASK0</name>
					<description>Segment Mask 0</description>
					<addressOffset>0x80</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SEGEN</name>
							<description>Segment Enable. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>SEGMASK1</name>
					<description>Segment Mask 1</description>
					<addressOffset>0x90</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SEGEN</name>
							<description>Segment Enable. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>SEGDATA0</name>
					<description>Segment Data 0</description>
					<addressOffset>0xa0</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SEGPIN0</name>
							<description>Segment LCDn.0 Control. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>SEGPIN1</name>
							<description>Segment LCDn.1 Control. </description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>SEGPIN2</name>
							<description>Segment LCDn.2 Control. </description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>SEGPIN3</name>
							<description>Segment LCDn.3 Control. </description>
							<bitOffset>12</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>SEGPIN4</name>
							<description>Segment LCDn.4 Control. </description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>SEGPIN5</name>
							<description>Segment LCDn.5 Control. </description>
							<bitOffset>20</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>SEGPIN6</name>
							<description>Segment LCDn.6 Control. </description>
							<bitOffset>24</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>SEGPIN7</name>
							<description>Segment LCDn.7 Control. </description>
							<bitOffset>28</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>SEGDATA1</name>
					<description>Segment Data 1</description>
					<addressOffset>0xb0</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SEGPIN8</name>
							<description>Segment LCDn.8 Control. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>SEGPIN9</name>
							<description>Segment LCDn.9 Control. </description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>SEGPIN10</name>
							<description>Segment LCDn.10 Control. </description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>SEGPIN11</name>
							<description>Segment LCDn.11 Control. </description>
							<bitOffset>12</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>SEGPIN12</name>
							<description>Segment LCDn.12 Control. </description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>SEGPIN13</name>
							<description>Segment LCDn.13 Control. </description>
							<bitOffset>20</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>SEGPIN14</name>
							<description>Segment LCDn.14 Control. </description>
							<bitOffset>24</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>SEGPIN15</name>
							<description>Segment LCDn.15 Control. </description>
							<bitOffset>28</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>SEGDATA2</name>
					<description>Segment Data 2</description>
					<addressOffset>0xc0</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SEGPIN16</name>
							<description>Segment LCDn.16 Control. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>SEGPIN17</name>
							<description>Segment LCDn.17 Control. </description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>SEGPIN18</name>
							<description>Segment LCDn.18 Control. </description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>SEGPIN19</name>
							<description>Segment LCDn.19 Control. </description>
							<bitOffset>12</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>SEGPIN20</name>
							<description>Segment LCDn.20 Control. </description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>SEGPIN21</name>
							<description>Segment LCDn.21 Control. </description>
							<bitOffset>20</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>SEGPIN22</name>
							<description>Segment LCDn.22 Control. </description>
							<bitOffset>24</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>SEGPIN23</name>
							<description>Segment LCDn.23 Control. </description>
							<bitOffset>28</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>SEGDATA3</name>
					<description>Segment Data 3</description>
					<addressOffset>0xd0</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SEGPIN24</name>
							<description>Segment LCDn.24 Control. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>SEGPIN25</name>
							<description>Segment LCDn.25 Control. </description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>SEGPIN26</name>
							<description>Segment LCDn.26 Control. </description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>SEGPIN27</name>
							<description>Segment LCDn.27 Control. </description>
							<bitOffset>12</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>SEGPIN28</name>
							<description>Segment LCDn.28 Control. </description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>SEGPIN29</name>
							<description>Segment LCDn.29 Control. </description>
							<bitOffset>20</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>SEGPIN30</name>
							<description>Segment LCDn.30 Control. </description>
							<bitOffset>24</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>SEGPIN31</name>
							<description>Segment LCDn.31 Control. </description>
							<bitOffset>28</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>SEGDATA4</name>
					<description>Segment Data 4</description>
					<addressOffset>0xe0</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SEGPIN32</name>
							<description>Segment LCDn.32 Control. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>SEGPIN33</name>
							<description>Segment LCDn.33 Control. </description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>SEGPIN34</name>
							<description>Segment LCDn.34 Control. </description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>SEGPIN35</name>
							<description>Segment LCDn.35 Control. </description>
							<bitOffset>12</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>SEGPIN36</name>
							<description>Segment LCDn.36 Control. </description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>SEGPIN37</name>
							<description>Segment LCDn.37 Control. </description>
							<bitOffset>20</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>SEGPIN38</name>
							<description>Segment LCDn.38 Control. </description>
							<bitOffset>24</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>SEGPIN39</name>
							<description>Segment LCDn.39 Control. </description>
							<bitOffset>28</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
					</fields>
				</register>
