0xsmirk/mcu_cmsis_svd/SiliconLabs/SiM3_NRND/SIM3L1x6.svd
				<register>
					<name>SQ7654</name>
					<description>Channel Sequencer Time Slots 4-7 Setup</description>
					<addressOffset>0x20</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>TS4CHR</name>
							<description>Time Slot 4 Conversion Characteristic. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>CC0</name>
									<description>Select conversion characteristic 0 for time slot 4.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CC1</name>
									<description>Select conversion characteristic 1 for time slot 4.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CC2</name>
									<description>Select conversion characteristic 2 for time slot 4.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CC3</name>
									<description>Select conversion characteristic 3 for time slot 4.</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TS4MUX</name>
							<description>Time Slot 4 Input Channel. </description>
							<bitOffset>2</bitOffset>
							<bitWidth>5</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>ADCN0</name>
									<description>Select channel ADCn.0 (PB0.3).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN1</name>
									<description>Select channel ADCn.1 (PB0.8).</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN2</name>
									<description>Select channel ADCn.2 (PB0.9).</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN3</name>
									<description>Select channel ADCn.3 (PB1.4).</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN4</name>
									<description>Select channel ADCn.4 (PB1.5).</description>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN5</name>
									<description>Select channel ADCn.5 (PB1.6).</description>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN6</name>
									<description>Select channel ADCn.6 (PB2.0).</description>
									<value>6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN7</name>
									<description>Select channel ADCn.7 (PB2.4).</description>
									<value>7</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN8</name>
									<description>Select channel ADCn.8 (PB2.5).</description>
									<value>8</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN9</name>
									<description>Select channel ADCn.9 (PB2.6).</description>
									<value>9</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN10</name>
									<description>Select channel ADCn.10 (PB2.7).</description>
									<value>10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN11</name>
									<description>Select channel ADCn.11 (PB3.0).</description>
									<value>11</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN12</name>
									<description>Select channel ADCn.12 (PB3.1).</description>
									<value>12</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN13</name>
									<description>Select channel ADCn.13 (PB3.8).</description>
									<value>13</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN14</name>
									<description>Select channel ADCn.14 (PB3.9).</description>
									<value>14</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN15</name>
									<description>Select channel ADCn.15 (PB3.10).</description>
									<value>15</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN16</name>
									<description>Select channel ADCn.16 (PB3.11).</description>
									<value>16</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN17</name>
									<description>Select channel ADCn.17 (PB4.0).</description>
									<value>17</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN18</name>
									<description>Select channel ADCn.18 (PB4.1).</description>
									<value>18</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN19</name>
									<description>Select channel ADCn.19 (PB4.2).</description>
									<value>19</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN20</name>
									<description>Select channel ADCn.20 (PB0.0).</description>
									<value>20</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN21</name>
									<description>Select channel ADCn.21 (RESERVED).</description>
									<value>21</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN22</name>
									<description>Select channel ADCn.22 (PB0.2).</description>
									<value>22</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN23</name>
									<description>Select channel ADCn.23 (PB0.3).</description>
									<value>23</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN24</name>
									<description>Select channel ADCn.24 (VSS).</description>
									<value>24</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN25</name>
									<description>Select channel ADCn.25 (Digital LDO Output).</description>
									<value>25</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN26</name>
									<description>Select channel ADCn.26 (Memory LDO Output).</description>
									<value>26</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN27</name>
									<description>Select channel ADCn.27 (VDC).</description>
									<value>27</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN28</name>
									<description>Select channel ADCn.28 (VBAT).</description>
									<value>28</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN29</name>
									<description>Select channel ADCn.29 (1/2 Charge Pump Output).</description>
									<value>29</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN30</name>
									<description>Select channel ADCn.30 (Temperature Sensor Output).</description>
									<value>30</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>END</name>
									<description>None - End the sequence.</description>
									<value>31</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TS5CHR</name>
							<description>Time Slot 5 Conversion Characteristic. </description>
							<bitOffset>8</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>CC0</name>
									<description>Select conversion characteristic 0 for time slot 5.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CC1</name>
									<description>Select conversion characteristic 1 for time slot 5.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CC2</name>
									<description>Select conversion characteristic 2 for time slot 5.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CC3</name>
									<description>Select conversion characteristic 3 for time slot 5.</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TS5MUX</name>
							<description>Time Slot 5 Input Channel. </description>
							<bitOffset>10</bitOffset>
							<bitWidth>5</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>ADCN0</name>
									<description>Select channel ADCn.0 (PB0.3).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN1</name>
									<description>Select channel ADCn.1 (PB0.8).</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN2</name>
									<description>Select channel ADCn.2 (PB0.9).</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN3</name>
									<description>Select channel ADCn.3 (PB1.4).</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN4</name>
									<description>Select channel ADCn.4 (PB1.5).</description>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN5</name>
									<description>Select channel ADCn.5 (PB1.6).</description>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN6</name>
									<description>Select channel ADCn.6 (PB2.0).</description>
									<value>6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN7</name>
									<description>Select channel ADCn.7 (PB2.4).</description>
									<value>7</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN8</name>
									<description>Select channel ADCn.8 (PB2.5).</description>
									<value>8</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN9</name>
									<description>Select channel ADCn.9 (PB2.6).</description>
									<value>9</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN10</name>
									<description>Select channel ADCn.10 (PB2.7).</description>
									<value>10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN11</name>
									<description>Select channel ADCn.11 (PB3.0).</description>
									<value>11</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN12</name>
									<description>Select channel ADCn.12 (PB3.1).</description>
									<value>12</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN13</name>
									<description>Select channel ADCn.13 (PB3.8).</description>
									<value>13</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN14</name>
									<description>Select channel ADCn.14 (PB3.9).</description>
									<value>14</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN15</name>
									<description>Select channel ADCn.15 (PB3.10).</description>
									<value>15</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN16</name>
									<description>Select channel ADCn.16 (PB3.11).</description>
									<value>16</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN17</name>
									<description>Select channel ADCn.17 (PB4.0).</description>
									<value>17</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN18</name>
									<description>Select channel ADCn.18 (PB4.1).</description>
									<value>18</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN19</name>
									<description>Select channel ADCn.19 (PB4.2).</description>
									<value>19</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN20</name>
									<description>Select channel ADCn.20 (PB0.0).</description>
									<value>20</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN21</name>
									<description>Select channel ADCn.21 (RESERVED).</description>
									<value>21</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN22</name>
									<description>Select channel ADCn.22 (PB0.2).</description>
									<value>22</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN23</name>
									<description>Select channel ADCn.23 (PB0.3).</description>
									<value>23</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN24</name>
									<description>Select channel ADCn.24 (VSS).</description>
									<value>24</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN25</name>
									<description>Select channel ADCn.25 (Digital LDO Output).</description>
									<value>25</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN26</name>
									<description>Select channel ADCn.26 (Memory LDO Output).</description>
									<value>26</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN27</name>
									<description>Select channel ADCn.27 (VDC).</description>
									<value>27</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN28</name>
									<description>Select channel ADCn.28 (VBAT).</description>
									<value>28</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN29</name>
									<description>Select channel ADCn.29 (1/2 Charge Pump Output).</description>
									<value>29</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN30</name>
									<description>Select channel ADCn.30 (Temperature Sensor Output).</description>
									<value>30</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>END</name>
									<description>None - End the sequence.</description>
									<value>31</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TS6CHR</name>
							<description>Time Slot 6 Conversion Characteristic. </description>
							<bitOffset>16</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>CC0</name>
									<description>Select conversion characteristic 0 for time slot 6.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CC1</name>
									<description>Select conversion characteristic 1 for time slot 6.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CC2</name>
									<description>Select conversion characteristic 2 for time slot 6.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CC3</name>
									<description>Select conversion characteristic 3 for time slot 6.</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TS6MUX</name>
							<description>Time Slot 6 Input Channel. </description>
							<bitOffset>18</bitOffset>
							<bitWidth>5</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>ADCN0</name>
									<description>Select channel ADCn.0 (PB0.3).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN1</name>
									<description>Select channel ADCn.1 (PB0.8).</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN2</name>
									<description>Select channel ADCn.2 (PB0.9).</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN3</name>
									<description>Select channel ADCn.3 (PB1.4).</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN4</name>
									<description>Select channel ADCn.4 (PB1.5).</description>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN5</name>
									<description>Select channel ADCn.5 (PB1.6).</description>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN6</name>
									<description>Select channel ADCn.6 (PB2.0).</description>
									<value>6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN7</name>
									<description>Select channel ADCn.7 (PB2.4).</description>
									<value>7</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN8</name>
									<description>Select channel ADCn.8 (PB2.5).</description>
									<value>8</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN9</name>
									<description>Select channel ADCn.9 (PB2.6).</description>
									<value>9</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN10</name>
									<description>Select channel ADCn.10 (PB2.7).</description>
									<value>10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN11</name>
									<description>Select channel ADCn.11 (PB3.0).</description>
									<value>11</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN12</name>
									<description>Select channel ADCn.12 (PB3.1).</description>
									<value>12</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN13</name>
									<description>Select channel ADCn.13 (PB3.8).</description>
									<value>13</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN14</name>
									<description>Select channel ADCn.14 (PB3.9).</description>
									<value>14</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN15</name>
									<description>Select channel ADCn.15 (PB3.10).</description>
									<value>15</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN16</name>
									<description>Select channel ADCn.16 (PB3.11).</description>
									<value>16</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN17</name>
									<description>Select channel ADCn.17 (PB4.0).</description>
									<value>17</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN18</name>
									<description>Select channel ADCn.18 (PB4.1).</description>
									<value>18</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN19</name>
									<description>Select channel ADCn.19 (PB4.2).</description>
									<value>19</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN20</name>
									<description>Select channel ADCn.20 (PB0.0).</description>
									<value>20</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN21</name>
									<description>Select channel ADCn.21 (RESERVED).</description>
									<value>21</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN22</name>
									<description>Select channel ADCn.22 (PB0.2).</description>
									<value>22</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN23</name>
									<description>Select channel ADCn.23 (PB0.3).</description>
									<value>23</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN24</name>
									<description>Select channel ADCn.24 (VSS).</description>
									<value>24</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN25</name>
									<description>Select channel ADCn.25 (Digital LDO Output).</description>
									<value>25</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN26</name>
									<description>Select channel ADCn.26 (Memory LDO Output).</description>
									<value>26</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN27</name>
									<description>Select channel ADCn.27 (VDC).</description>
									<value>27</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN28</name>
									<description>Select channel ADCn.28 (VBAT).</description>
									<value>28</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN29</name>
									<description>Select channel ADCn.29 (1/2 Charge Pump Output).</description>
									<value>29</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN30</name>
									<description>Select channel ADCn.30 (Temperature Sensor Output).</description>
									<value>30</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>END</name>
									<description>None - End the sequence.</description>
									<value>31</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TS7CHR</name>
							<description>Time Slot 7 Conversion Characteristic. </description>
							<bitOffset>24</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>CC0</name>
									<description>Select conversion characteristic 0 for time slot 7.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CC1</name>
									<description>Select conversion characteristic 1 for time slot 7.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CC2</name>
									<description>Select conversion characteristic 2 for time slot 7.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CC3</name>
									<description>Select conversion characteristic 3 for time slot 7.</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TS7MUX</name>
							<description>Time Slot 7 Input Channel. </description>
							<bitOffset>26</bitOffset>
							<bitWidth>5</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>ADCN0</name>
									<description>Select channel ADCn.0 (PB0.3).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN1</name>
									<description>Select channel ADCn.1 (PB0.8).</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN2</name>
									<description>Select channel ADCn.2 (PB0.9).</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN3</name>
									<description>Select channel ADCn.3 (PB1.4).</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN4</name>
									<description>Select channel ADCn.4 (PB1.5).</description>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN5</name>
									<description>Select channel ADCn.5 (PB1.6).</description>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN6</name>
									<description>Select channel ADCn.6 (PB2.0).</description>
									<value>6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN7</name>
									<description>Select channel ADCn.7 (PB2.4).</description>
									<value>7</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN8</name>
									<description>Select channel ADCn.8 (PB2.5).</description>
									<value>8</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN9</name>
									<description>Select channel ADCn.9 (PB2.6).</description>
									<value>9</value>
